Обработки/DataProcessors/_ЭкспортДвиженийАкций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_ЭкспортДвиженийАкций</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучателиОповещений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеСвойства</Name>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Обработки/DataProcessors/_ЭкспортДвиженийАкций/Ext/ObjectModule.bsl
Перем КодыПифов;
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		"ДополнительнаяОбработка",
		"Экспорт движений акций",
		"0.14",
		"",
		Истина);
		
	// команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ЭкспортДанных" ,  "Экспорт движений акций(РЭМ)"  ,,  Ложь, "ВызовСерверногоМетода");
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ЭкспортДанных1",  "Экспорт движений акций(Траст)",,  Ложь, "ВызовСерверногоМетода");
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ЭкспортДанных2",  "Экспорт движений акций(РПИ)"  ,,  Ложь, "ВызовСерверногоМетода");
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "Проверка"		 , 	"Проверка выгруженных данных"  ,,  Ложь, "ВызовСерверногоМетода");
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

// Интерфейс для запуска обработки
//
// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды
//     ПараметрыОбработки (структура) - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//     элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	
	Если ЭтоРабочийДень(ТекущаяДата()) Тогда
	
		ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды);
	
		УстановитьПериодВыгрузки(ТекущаяДата());
		ПолучателиОповещений	= ПараметрыКоманды.ПолучателиОповещений;
		Организация 			= ПараметрыКоманды.Организация;
		
		ПараметрыСессии = ЗарегистрироватьНовуюСессию(ИдентификаторКоманды);
		Попытка
			//ВыгрузитьДанные();
			Если СтрНайти(ИдентификаторКоманды, "Проверка") > 0 Тогда
				ВыполнитьПроверку(,ПараметрыСессии);
			Иначе
				ВыгрузитьДанные(ПараметрыСессии);
			КонецЕсли;
		Исключение
			ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		
		ТекстОшибок = ПолучитьТекстОшибок();
		ОповеститьОбОшибках();
		
		Если ЗначениеЗаполнено(ТекстОшибок) Тогда
			ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибок);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЭтоРабочийДень(Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеКалендаря.ВидДня КАК ВидДня
	|ИЗ
	|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
	|ГДЕ
	|	ДанныеКалендаря.Дата = &Дата
	|	И (ДанныеКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий)
	|			ИЛИ ДанныеКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))";
	
	Запрос.УстановитьПараметр("Дата", НачалоДня(Дата));
	
	Возврат НЕ Запрос.Выполнить().Пустой();

КонецФункции

Процедура УстановитьПериодВыгрузки(Дата)
	//Если текущий день первый рабочий(торговый) после выходных необходимо выгрузить данные и за выходные и за предшествующий выходным рабочий(торговый) день
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Дата КАК ДатаНачала,
	|	ДОБАВИТЬКДАТЕ(&Дата, СЕКУНДА, -1) КАК ДатаОкончания
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(ДанныеКалендаря.Дата) КАК Дата
	|	ИЗ
	|		РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
	|	ГДЕ
	|		ДанныеКалендаря.Дата < &Дата
	|		И (ДанныеКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий)
	|				ИЛИ ДанныеКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
	|		И ДанныеКалендаря.Дата > ДОБАВИТЬКДАТЕ(&Дата, ДЕНЬ, -12)) КАК ВложенныйЗапрос";
	
	Запрос.УстановитьПараметр("Дата", НачалоДня(Дата));
	
	Результат = Запрос.Выполнить().Выгрузить();
		
	Период.ДатаНачала 	 = Результат[0].ДатаНачала;
	Период.ДатаОкончания = Результат[0].ДатаОкончания;
			
КонецПроцедуры

Процедура ЗарегистрироватьОшибку(ТекстОшибки, ПараметрыСессии = Неопределено)
	
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки") Тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("Ошибки", Новый Массив());
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Ошибки.Найти(ТекстОшибки)= Неопределено Тогда
		ЭтотОбъект.ДополнительныеСвойства.Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;
	
	Если ПараметрыСессии <> Неопределено Тогда
		ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОповеститьОбОшибках(ЕстьОшибки = Неопределено)
	
	ЕстьОшибки = ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки");
	
	Если Не ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("Источник") Тогда
		РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку(ЭтотОбъект.ДополнительныеСвойства.Ошибки, ЭтотОбъект.ДополнительныеСвойства.Источник);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(ЭтотОбъект.ДополнительныеСвойства.Ошибки, Символы.ПС));
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ПолучателиОповещений) Тогда
		СтрокаСообщения = "";
		Для каждого ЭлементМассива Из ЭтотОбъект.ДополнительныеСвойства.Ошибки Цикл
			СтрокаСообщения = СтрокаСообщения + ?(ЗначениеЗаполнено(СтрокаСообщения), Символы.ПС, "") + ЭлементМассива;
		КонецЦикла; 
		ТемаПисьма = "Ошибка при выгрузке в MatriX_External (Движение акций)!";
		РаботаСЭлектроннойПочтой.ОтправитьПростоеЭлектронноеПисьмо(ПолучателиОповещений, ТемаПисьма, СтрокаСообщения);
	КонецЕсли;	
	ЭтотОбъект.ДополнительныеСвойства.Очистить();
	
КонецПроцедуры

#Область СтатистикаРаботыВнутреннихМеханизмов

Процедура ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки) Экспорт

	Если ПараметрыСессии = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(ПараметрыСессии.ТекстОшибки) Тогда
		ПараметрыСессии.ТекстОшибки = ПараметрыСессии.ТекстОшибки + Символы.ПС + ТекстОшибки;
	Иначе
		ПараметрыСессии.ТекстОшибки = ТекстОшибки;
	КонецЕсли;

КонецПроцедуры

Функция ЗарегистрироватьНовуюСессию(ИмяКоманды) Экспорт

	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект);

	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",      Механизм);
	ПараметрыСессии.Вставить("Сессия",        Сессия);
	ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии) Экспорт

	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);

КонецПроцедуры

Функция ПолучитьТекстОшибок()
	
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки") Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(ЭтотОбъект.ДополнительныеСвойства.Ошибки, Символы.ПС);
	
КонецФункции

#КонецОбласти

Процедура ВыполнитьПроверку(Соединение = Неопределено, ПараметрыСессии = Неопределено)
	
	Если Соединение = Неопределено Тогда
		Соединение = РаботаСВнешнимиСистемами.ADODBC_УстановитьСоединение("Driver={SQL Server};Server=AP15.G1.LAN;UID=svc_API_AM;PWD=p8z4gr39VAxXAfhn;Database=MatriX_External"); 
		Если Соединение = Неопределено Тогда
			ЗарегистрироватьОшибку("Не удалось установить соединение  с MatriX_External", ПараметрыСессии);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	ДатаНач = Период.ДатаНачала - (60 * 60 * 24 * 7); //Неделя
	ДатаКон = Период.ДатаОкончания;
	
	ТекстСообщения = "";
	Пока ДатаНач <= ДатаКон Цикл
	
		ТекстЗапроса = 		
		//"SELECT 
		//|[End_Remains].[System_UID],
		//|[End_Remains].[Invest_Code],
		//|[End_Remains].[Security_ID],
		//|CAST (ISNULL ([Begin_Remains].[Volume], 0) AS decimal(10,0)) AS Begin_Volume,
		//|CAST (ISNULL ([Operations_Sum].[Movement], 0) AS decimal(10,0)) AS Movement_Volume,
		//|CAST (ISNULL ([End_Remains].[Volume], 0) AS decimal(10,0)) AS End_Volume
		//|FROM [MatriX_External].[AM].[Shares_Group_Ownership_Remains] AS End_Remains
		//|	LEFT OUTER JOIN (SELECT Company_ID, Client_ID, Invest_Code, Security_ID, SUM(Direction * Volume) AS 'Movement' 
		//|					 FROM [MatriX_External].[AM].[Shares_Group_Ownership_Operations] 
		//|					 WHERE Settlement_Date BETWEEN '" + SQL_Format(ДатаНач) + "' AND '" + SQL_Format(ДатаНач) + "'
		//|					 GROUP BY Company_ID, Client_ID, Invest_Code, Security_ID) AS Operations_Sum
		//|			ON [End_Remains].[Company_ID] = [Operations_Sum].[Company_ID]
		//|			AND [End_Remains].[Client_ID] = [Operations_Sum].[Client_ID]
		//|			AND [End_Remains].[Invest_Code] = [Operations_Sum].[Invest_Code]
		//|			AND [End_Remains].[Security_ID] = [Operations_Sum].[Security_ID]
		//|	LEFT OUTER JOIN (SELECT Company_ID, Client_ID, Invest_Code, Security_ID, Volume
		//|					 FROM  [MatriX_External].[AM].[Shares_Group_Ownership_Remains]
		//|					 WHERE [Date] = '" + SQL_Format(ДатаНач - 1) + "') AS Begin_Remains
		//|			ON [End_Remains].[Company_ID] = [Begin_Remains].[Company_ID]
		//|			AND [End_Remains].[Client_ID] = [Begin_Remains].[Client_ID]
		//|			AND [End_Remains].[Invest_Code] = [Begin_Remains].[Invest_Code]
		//|			AND [End_Remains].[Security_ID] = [Begin_Remains].[Security_ID]
		//|WHERE [End_Remains].[Date] = '" + SQL_Format(ДатаНач) + "'
		//|AND (ISNULL([Begin_Remains].[Volume], 0) + ISNULL([Operations_Sum].[Movement], 0)) <> ISNULL([End_Remains].[Volume], 0)";
		
		"SELECT 
		|[Invest_Codes].[System_UID],
		|[Invest_Codes].[Invest_Code],
		|[Invest_Codes].[Security_ID],
		|CAST (ISNULL ([Begin_Remains].[Volume], 0) AS decimal(10,0)) AS Begin_Volume,
		|CAST (ISNULL ([Operations_Sum].[Movement], 0) AS decimal(10,0)) AS Movement_Volume,
		|CAST (ISNULL ([End_Remains].[Volume], 0) AS decimal(10,0)) AS End_Volume
		|FROM (SELECT DISTINCT (Security_ID) AS Security_ID , Invest_Code, Client_ID, Company_ID, System_UID
		|	  	FROM  [MatriX_External].[AM].[Shares_Group_Ownership_Remains]
		|	  	WHERE [Date] BETWEEN '" + SQL_Format(ДатаНач - 1) + "' AND '" + SQL_Format(ДатаНач) + "' 
		|		AND System_UID IN ('1С.UK.RASM', '1С.UK.Trust', '1С.UK.RPI')) AS Invest_Codes
		|	LEFT OUTER JOIN (SELECT Company_ID, System_UID, Client_ID, Invest_Code, Security_ID, Volume
		|				 	 FROM  [MatriX_External].[AM].[Shares_Group_Ownership_Remains]
		|					 WHERE [Date] = '" + SQL_Format(ДатаНач - 1) + "') AS Begin_Remains
		|		ON [Invest_Codes].[Invest_Code] = [Begin_Remains].[Invest_Code]
		|	 	AND [Invest_Codes].[Client_ID] = [Begin_Remains].[Client_ID]
		|	 	AND [Invest_Codes].[Invest_Code] = [Begin_Remains].[Invest_Code]
		|	 	AND [Invest_Codes].[Security_ID] = [Begin_Remains].[Security_ID]
		|	LEFT OUTER JOIN (SELECT Company_ID, Client_ID, Invest_Code, Security_ID, SUM(Direction * Volume) AS 'Movement' 
		|				 	 FROM [MatriX_External].[AM].[Shares_Group_Ownership_Operations] 
		|					 WHERE Settlement_Date BETWEEN '" + SQL_Format(ДатаНач) + "' AND '" + SQL_Format(ДатаНач) + "'
		|				 	 GROUP BY Company_ID, Client_ID, Invest_Code, Security_ID) AS Operations_Sum
		|		ON [Invest_Codes].[Company_ID] = [Operations_Sum].[Company_ID]
		|		AND [Invest_Codes].[Client_ID] = [Operations_Sum].[Client_ID]
		|		AND [Invest_Codes].[Invest_Code] = [Operations_Sum].[Invest_Code]
		|		AND [Invest_Codes].[Security_ID] = [Operations_Sum].[Security_ID]
		|	LEFT OUTER JOIN (SELECT Company_ID, System_UID, Client_ID, Invest_Code, Security_ID, Volume
		|				 	 FROM  [MatriX_External].[AM].[Shares_Group_Ownership_Remains]
		|				 	 WHERE [Date] = '" + SQL_Format(ДатаНач) + "') AS End_Remains
		|		ON [Invest_Codes].[Company_ID] = [End_Remains].[Company_ID]
		|		AND [Invest_Codes].[Client_ID] = [End_Remains].[Client_ID]
		|		AND [Invest_Codes].[Invest_Code] = [End_Remains].[Invest_Code]
		|		AND [Invest_Codes].[Security_ID] = [End_Remains].[Security_ID]
		|WHERE (ISNULL([Begin_Remains].[Volume], 0) + ISNULL([Operations_Sum].[Movement], 0)) <> ISNULL([End_Remains].[Volume], 0)";
		
		НаборЗаписей = РаботаСВнешнимиСистемами.ADODBC_ВыполнитьЗапрос(Соединение, ТекстЗапроса);
		Если НаборЗаписей = Неопределено Тогда
			ЗарегистрироватьОшибку("Не удалось выпонить запрос проверки!", ПараметрыСессии);
			Возврат;
		Иначе 
			ТаблицаОшибок = РаботаСВнешнимиСистемами.ADODBC_ВыгрузитьНаборВТаблицуЗначений(НаборЗаписей);
			Если ТаблицаОшибок = Неопределено Тогда
				ДатаНач = ДатаНач + (60 * 60 * 24);
				Продолжить;
			ИначеЕсли ТаблицаОшибок.Количество() > 0 Тогда
				Для Каждого Стр Из ТаблицаОшибок Цикл
					ТекстСообщения = ТекстСообщения + 
					"<tr>
					|	<td>" + Формат(ДатаНач, "ДЛФ=Д") + "</td>
					|	<td>" + Стр.System_UID			 + "</td>
					|	<td>" + Стр.Invest_Code			 + "</td>
					|	<td>" + Стр.Security_ID			 + "</td>
					|	<td>" + Стр.Begin_Volume		 + "</td>
					|	<td>" + Стр.Movement_Volume		 + "</td>
					|	<td>" + Стр.End_Volume			 + "</td>
					|</tr>" + Символы.ПС;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		ДатаНач = ДатаНач + (60 * 60 * 24);
	КонецЦикла;
	
	Если ТекстСообщения <> "" Тогда
		ТекстСообщения =
		"<html>
		|<head content=""text/html"" http-equiv=""Content-Type"" charset=""utf-8"">
		|	<style>
		|		body {
		|			font: 8pt sans-serif;
		|		}
		|		table {
		|			text-align: center;
		|			border-spacing: 0;
		|			border-collapse: collapse;
		|		}
		|		td {
		|			font-size: 1em;
		|			border: 1px solid black;
		|			padding: 5px 20px 5px 20px;
		|		}
		|		.top {
		|			color: black;
		|			font-size: 12px;
		|			background: lightgrey;
		|		}
		|	</style>
		|</head>
		|<body>
		|<table cols=""6""> 
		|<tr class=""top"">
		|<td>Дата</td>
		|<td>КодУК</td>
		|<td>СчетДУ</td>
		|<td>КодЦБ</td>
		|<td>Нач.Остаток</td>
		|<td>Оборот</td>
		|<td>Кон.Остаток</td>
		|</tr>"
		+ ТекстСообщения + "</table></body></html>";
		
		Если ЗначениеЗаполнено(ПолучателиОповещений) Тогда
			ПараметрыПисьма = Новый Структура("Кому, Тема, Тело, ТипТекста",
			ПолучателиОповещений,
			"Ошибка при проверке данных в MatriX_External (Движение акций)!",
			ТекстСообщения,
			"HTML");
			РаботаСЭлектроннойПочтой.ОтправитьЭлектронноеПисьмо(РаботаСЭлектроннойПочтой.ПолучитьСистемнуюУчетнуюЗапись(), ПараметрыПисьма);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Функция SQL_Format(Дата = Неопределено, Время =  Неопределено, Число =  Неопределено)
	
	Если Не Дата = Неопределено Тогда
		Если ЗначениеЗаполнено(Дата) Тогда
			Возврат  Формат(Дата, "ДЛФ=Д"); 
		Иначе
			Возврат "NULL";
		КонецЕсли;
	ИначеЕсли Не Время = Неопределено Тогда
		Если ЗначениеЗаполнено(Время) Тогда
			Возврат  Формат(Время, "ДФ=HH:mm:ss");
		Иначе
			Возврат "NULL";
		КонецЕсли;
	ИначеЕсли Не Число = Неопределено Тогда
		ЧислоSQL = Формат(Число, "ЧРД=.; ЧГ=0");
		Если ПустаяСтрока(ЧислоSQL) Тогда
			Возврат "0";
		КонецЕсли;
		
		Возврат ЧислоSQL;
	КонецЕсли;

КонецФункции

Функция СформироватьДанныеДляВыгрузки()
	
	ДанныеДляВыгрузки = Новый Структура();
	//Операции
	Запрос = Новый Запрос;
	
	#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиЦенныхБумаг.Период КАК ДатаИсполнения,
		|	ЕСТЬNULL(СвязанныеЮридическиеЛицаСрезПоследних.РодительскоеЮридическоеЛицо, ОстаткиЦенныхБумаг.Организация.ЮрФизЛицо) КАК ОрганизацияЮрФизЛицо,
		|	ОстаткиЦенныхБумаг.СчетДоверительногоУправления КАК СчетДУ,
		|	ВЫБОР
		|		КОГДА ОстаткиЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА 1
		|		КОГДА ОстаткиЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|			ТОГДА -1
		|	КОНЕЦ КАК ВидДвижения,
		|	ВЫБОР
		|		КОГДА ОстаткиЦенныхБумаг.Регистратор ССЫЛКА Документ.КонвертацияЦенныхБумаг
		|				ИЛИ ОстаткиЦенныхБумаг.Регистратор ССЫЛКА Документ.КорректировкаРегистров
		|				ИЛИ ОстаткиЦенныхБумаг.Регистратор ССЫЛКА Документ.СнятиеЦеннойБумагиСУчета
		|			ТОГДА ВЫБОР
		|					КОГДА ОстаткиЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|						ТОГДА ""IN""
		|					КОГДА ОстаткиЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|						ТОГДА ""OUT""
		|				КОНЕЦ
		|		КОГДА ОстаткиЦенныхБумаг.Регистратор ССЫЛКА Документ.ВводЦенныхБумаг
		|			ТОГДА ""IN""
		|		КОГДА ОстаткиЦенныхБумаг.Регистратор ССЫЛКА Документ.ВыводЦенныхБумаг
		|			ТОГДА ""OUT""
		|		КОГДА ОстаткиЦенныхБумаг.Регистратор ССЫЛКА Документ.Сделка
		|				ИЛИ ОстаткиЦенныхБумаг.Регистратор ССЫЛКА Документ.СделкаРЕПО
		|			ТОГДА ВЫБОР
		|					КОГДА ОстаткиЦенныхБумаг.Регистратор.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|						ТОГДА ""BUY""
		|					КОГДА ОстаткиЦенныхБумаг.Регистратор.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|						ТОГДА ""SELL""
		|				КОНЕЦ
		|		КОГДА ОстаткиЦенныхБумаг.Регистратор ССЫЛКА Документ.ИсполнениеОбязательствПоСделке
		|				ИЛИ ОстаткиЦенныхБумаг.Регистратор ССЫЛКА Документ.ПоставкаЦенныхБумаг
		|				ИЛИ ОстаткиЦенныхБумаг.Регистратор ССЫЛКА Документ.ОтменаСделки
		|			ТОГДА ВЫБОР
		|					КОГДА ВложенныйЗапрос.Основание.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|						ТОГДА ""BUY""
		|					КОГДА ВложенныйЗапрос.Основание.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|						ТОГДА ""SELL""
		|				КОНЕЦ
		|	КОНЕЦ КАК ВидСделки,
		|	ОстаткиЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ОстаткиЦенныхБумаг.Количество КАК Количество,
		|	ВЫБОР
		|		КОГДА ОстаткиЦенныхБумаг.Регистратор ССЫЛКА Документ.ВводЦенныхБумаг
		|				ИЛИ ОстаткиЦенныхБумаг.Регистратор ССЫЛКА Документ.ВыводЦенныхБумаг
		|				ИЛИ ОстаткиЦенныхБумаг.Регистратор ССЫЛКА Документ.КонвертацияЦенныхБумаг
		|				ИЛИ ОстаткиЦенныхБумаг.Регистратор ССЫЛКА Документ.КорректировкаРегистров
		|				ИЛИ ОстаткиЦенныхБумаг.Регистратор ССЫЛКА Документ.СнятиеЦеннойБумагиСУчета
		|			ТОГДА ОстаткиЦенныхБумаг.Регистратор.Номер
		|		КОГДА ОстаткиЦенныхБумаг.Регистратор ССЫЛКА Документ.Сделка
		|				ИЛИ ОстаткиЦенныхБумаг.Регистратор ССЫЛКА Документ.СделкаРЕПО
		|			ТОГДА ВЫБОР
		|					КОГДА ОстаткиЦенныхБумаг.Регистратор.НомерСделки = """"
		|							ИЛИ ОстаткиЦенныхБумаг.Регистратор.НомерСделки ЕСТЬ NULL
		|						ТОГДА ВЫБОР
		|								КОГДА ОстаткиЦенныхБумаг.Регистратор.НомерСделкиСЦентральнымКонтрагентом = """"
		|										ИЛИ ОстаткиЦенныхБумаг.Регистратор.НомерСделкиСЦентральнымКонтрагентом ЕСТЬ NULL
		|									ТОГДА ОстаткиЦенныхБумаг.Регистратор.Номер
		|								ИНАЧЕ ОстаткиЦенныхБумаг.Регистратор.НомерСделкиСЦентральнымКонтрагентом
		|							КОНЕЦ
		|					ИНАЧЕ ОстаткиЦенныхБумаг.Регистратор.НомерСделки
		|				КОНЕЦ
		|		КОГДА ОстаткиЦенныхБумаг.Регистратор ССЫЛКА Документ.ИсполнениеОбязательствПоСделке
		|				ИЛИ ОстаткиЦенныхБумаг.Регистратор ССЫЛКА Документ.ПоставкаЦенныхБумаг
		|				ИЛИ ОстаткиЦенныхБумаг.Регистратор ССЫЛКА Документ.ОтменаСделки
		|			ТОГДА ВЫБОР
		|					КОГДА ВложенныйЗапрос.Основание.НомерСделки = """"
		|							ИЛИ ВложенныйЗапрос.Основание.НомерСделки ЕСТЬ NULL
		|						ТОГДА ВЫБОР
		|								КОГДА ВложенныйЗапрос.Основание.НомерСделкиСЦентральнымКонтрагентом = """"
		|										ИЛИ ВложенныйЗапрос.Основание.НомерСделкиСЦентральнымКонтрагентом ЕСТЬ NULL
		|									ТОГДА ВложенныйЗапрос.Основание.Номер
		|								ИНАЧЕ ВложенныйЗапрос.Основание.НомерСделкиСЦентральнымКонтрагентом
		|							КОНЕЦ
		|					ИНАЧЕ ВложенныйЗапрос.Основание.НомерСделки
		|				КОНЕЦ
		|	КОНЕЦ КАК НомерСделки,
		|	ВЫБОР
		|		КОГДА ОстаткиЦенныхБумаг.Регистратор ССЫЛКА Документ.ИсполнениеОбязательствПоСделке
		|				ИЛИ ОстаткиЦенныхБумаг.Регистратор ССЫЛКА Документ.ПоставкаЦенныхБумаг
		|			ТОГДА ВложенныйЗапрос.Основание.Дата
		|		ИНАЧЕ ОстаткиЦенныхБумаг.Регистратор.Дата
		|	КОНЕЦ КАК Дата,
		|	ВЫБОР
		|		КОГДА ОстаткиЦенныхБумаг.Регистратор ССЫЛКА Документ.ИсполнениеОбязательствПоСделке
		|				ИЛИ ОстаткиЦенныхБумаг.Регистратор ССЫЛКА Документ.ПоставкаЦенныхБумаг
		|			ТОГДА ВложенныйЗапрос.Основание.Дата
		|		ИНАЧЕ ОстаткиЦенныхБумаг.Регистратор.Дата
		|	КОНЕЦ КАК ВремяСделки
		|ПОМЕСТИТЬ _ОперацииСЦБ
		|ИЗ
		|	РегистрНакопления.ОстаткиЦенныхБумаг КАК ОстаткиЦенныхБумаг
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ОперацииСЦеннымиБумагами.Операция КАК Операция,
		|			ОперацииСЦеннымиБумагами.Основание КАК Основание,
		|			ОперацииСЦеннымиБумагами.ЦеннаяБумага КАК ЦеннаяБумага
		|		ИЗ
		|			РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|		ГДЕ
		|			(ОперацииСЦеннымиБумагами.Операция ССЫЛКА Документ.ИсполнениеОбязательствПоСделке
		|					ИЛИ ОперацииСЦеннымиБумагами.Операция ССЫЛКА Документ.ПоставкаЦенныхБумаг
		|					ИЛИ ОперацииСЦеннымиБумагами.Операция ССЫЛКА Документ.ОтменаСделки
		|						И ОперацииСЦеннымиБумагами.Организация = &Организация
		|						И ОперацииСЦеннымиБумагами.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|						И (ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода))) КАК ВложенныйЗапрос
		|		ПО ОстаткиЦенныхБумаг.Регистратор = ВложенныйЗапрос.Операция
		|			И ОстаткиЦенныхБумаг.ЦеннаяБумага = ВложенныйЗапрос.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязанныеЮридическиеЛица.СрезПоследних(&НачалоПериода, ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязейЮрФизЛиц.ГоловнаяОрганизация)) КАК СвязанныеЮридическиеЛицаСрезПоследних
		|		ПО ОстаткиЦенныхБумаг.Организация.ЮрФизЛицо = СвязанныеЮридическиеЛицаСрезПоследних.ЮридическоеЛицо
		|			И (СвязанныеЮридическиеЛицаСрезПоследних.Действует)
		|ГДЕ
		|	ОстаткиЦенныхБумаг.Организация = &Организация
		|	И ОстаткиЦенныхБумаг.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|	И ОстаткиЦенныхБумаг.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ ОстаткиЦенныхБумаг.Регистратор ССЫЛКА Документ.ПереводЦенныхБумаг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОперацииСЦБ.ДатаИсполнения КАК Settlement_Date,
		|	КодМатрихЮрЛицаОрганизацииСрезПоследних.Код КАК Company_ID,
		|	КодыМатрихКлиентовСрезПоследних.Код КАК Client_ID,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.Наименование КАК Client_Name,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.КодСчета КАК Invest_Code,
		|	_ОперацииСЦБ.ВидДвижения КАК Direction,
		|	_ОперацииСЦБ.ВидСделки КАК Operation_Type_UID,
		|	КодыМатрихАкцийСрезПоследних.Код КАК Security_ID,
		|	_ОперацииСЦБ.Количество КАК Volume,
		|	_ОперацииСЦБ.НомерСделки КАК Deal_Number,
		|	_ОперацииСЦБ.Дата КАК Deal_Date,
		|	_ОперацииСЦБ.ВремяСделки КАК Deal_Time
		|ИЗ
		|	_ОперацииСЦБ КАК _ОперацииСЦБ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&НачалоПериода, ) КАК КлиентыДоверительногоУправленияСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|					&НачалоПериода,
		|					ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих)
		|						И ГруппаОбъектов В (ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ЮридическиеЛица), ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ПаевыеИнвестиционныеФонды))) КАК КодыМатрихКлиентовСрезПоследних
		|			ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = КодыМатрихКлиентовСрезПоследних.Объект
		|		ПО _ОперацииСЦБ.СчетДУ = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|				&НачалоПериода,
		|				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих)
		|					И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Акции)) КАК КодыМатрихАкцийСрезПоследних
		|		ПО _ОперацииСЦБ.ЦеннаяБумага = КодыМатрихАкцийСрезПоследних.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|				&НачалоПериода,
		|				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих)
		|					И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ЮридическиеЛица)) КАК КодМатрихЮрЛицаОрганизацииСрезПоследних
		|		ПО _ОперацииСЦБ.ОрганизацияЮрФизЛицо = КодМатрихЮрЛицаОрганизацииСрезПоследних.Объект";	
	#КонецОбласти 
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	
	ДанныеДляВыгрузки.Вставить("Операции", Запрос.Выполнить().Выгрузить());
	//Остатки
	Запрос = Новый Запрос;
	
	#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДанныеКалендаря.Дата КАК Дата
		|ПОМЕСТИТЬ _Дни
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Дни.Дата КАК Дата,
		|	ЕСТЬNULL(СвязанныеЮридическиеЛицаСрезПоследних.РодительскоеЮридическоеЛицо, ОстаткиЦенныхБумагОстаткиИОбороты.Организация.ЮрФизЛицо) КАК ОрганизацияЮрФизЛицо,
		|	ОстаткиЦенныхБумагОстаткиИОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ОстаткиЦенныхБумагОстаткиИОбороты.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СУММА(ВЫБОР
		|			КОГДА _Дни.Дата = ОстаткиЦенныхБумагОстаткиИОбороты.Период
		|					И ОстаткиЦенныхБумагОстаткиИОбороты.КоличествоОборот < 0
		|					И ОстаткиЦенныхБумагОстаткиИОбороты.КоличествоКонечныйОстаток = 0
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Флаг,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиЦенныхБумагОстаткиИОбороты.Период = &НачалоПериода
		|				ТОГДА ОстаткиЦенныхБумагОстаткиИОбороты.КоличествоКонечныйОстаток
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ОстаткиЦенныхБумагОстаткиИОбороты.Период <= _Дни.Дата
		|						ТОГДА ОстаткиЦенныхБумагОстаткиИОбороты.КоличествоОборот
		|					ИНАЧЕ 0
		|				КОНЕЦ
		|		КОНЕЦ) КАК Количество
		|ПОМЕСТИТЬ _Остатки
		|ИЗ
		|	_Дни КАК _Дни,
		|	РегистрНакопления.ОстаткиЦенныхБумаг.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			День,
		|			,
		|			Организация = &Организация
		|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)) КАК ОстаткиЦенныхБумагОстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязанныеЮридическиеЛица.СрезПоследних(&НачалоПериода, ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязейЮрФизЛиц.ГоловнаяОрганизация)) КАК СвязанныеЮридическиеЛицаСрезПоследних
		|		ПО ОстаткиЦенныхБумагОстаткиИОбороты.Организация.ЮрФизЛицо = СвязанныеЮридическиеЛицаСрезПоследних.ЮридическоеЛицо
		|			И (СвязанныеЮридическиеЛицаСрезПоследних.Действует)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиЦенныхБумагОстаткиИОбороты.СчетДоверительногоУправления,
		|	ОстаткиЦенныхБумагОстаткиИОбороты.ЦеннаяБумага,
		|	_Дни.Дата,
		|	ЕСТЬNULL(СвязанныеЮридическиеЛицаСрезПоследних.РодительскоеЮридическоеЛицо, ОстаткиЦенныхБумагОстаткиИОбороты.Организация.ЮрФизЛицо)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Остатки.Дата КАК Date,
		|	КодМатрихЮрЛицаОрганизацииСрезПоследних.Код КАК Company_ID,
		|	КодыМатрихКлиентовСрезПоследних.Код КАК Client_ID,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.КодСчета КАК Invest_Code,
		|	КодыМатрихАкцийСрезПоследних.Код КАК Security_ID,
		|	_Остатки.Количество КАК Volume
		|ИЗ
		|	_Остатки КАК _Остатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&НачалоПериода, ) КАК КлиентыДоверительногоУправленияСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|					&НачалоПериода,
		|					ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих)
		|						И ГруппаОбъектов В (ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ЮридическиеЛица), ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ФизическиеЛица), ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ПаевыеИнвестиционныеФонды))) КАК КодыМатрихКлиентовСрезПоследних
		|			ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = КодыМатрихКлиентовСрезПоследних.Объект
		|		ПО _Остатки.СчетДоверительногоУправления = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|				&НачалоПериода,
		|				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих)
		|					И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ЮридическиеЛица)) КАК КодМатрихЮрЛицаОрганизацииСрезПоследних
		|		ПО _Остатки.ОрганизацияЮрФизЛицо = КодМатрихЮрЛицаОрганизацииСрезПоследних.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|				&НачалоПериода,
		|				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих)
		|					И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Акции)) КАК КодыМатрихАкцийСрезПоследних
		|		ПО _Остатки.ЦеннаяБумага = КодыМатрихАкцийСрезПоследних.Объект
		|ГДЕ
		|	(_Остатки.Флаг > 0
		|			ИЛИ _Остатки.Количество > 0)";
	#КонецОбласти 
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	
	ДанныеДляВыгрузки.Вставить("Остатки", Запрос.Выполнить().Выгрузить());
	
	Возврат ДанныеДляВыгрузки;
	
КонецФункции

Процедура ВыгрузитьДанные(ПараметрыСессии)
	
	Соединение = РаботаСВнешнимиСистемами.ADODBC_УстановитьСоединение("Driver={SQL Server};Server=AP15.G1.LAN;UID=svc_API_AM;PWD=p8z4gr39VAxXAfhn;Database=MatriX_External"); 
	Если Соединение = Неопределено Тогда
		ЗарегистрироватьОшибку("Не удалось установить соединение  с MatriX_External", ПараметрыСессии);
		Возврат;
	КонецЕсли;
	//1С. - русская раскладка  
	Если Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ") Тогда
		КодКомпании = "1С.UK.RASM";
	ИначеЕсли Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РПИ") Тогда
		КодКомпании = "1С.UK.RPI";
	Иначе
		ЗарегистрироватьОшибку("Для " + Организация.Наименование + " выгрузка не предусмотрена!", ПараметрыСессии);
		Возврат;
	КонецЕсли;
#Область ОТКРЫТИЕ_СЕСИИ
	//Открываем сессию
	ТекстЗапроса = "EXEC AM.usp_Shares_Group_Ownership_Export_Begin
	|@System_UID = '" + КодКомпании + "',
	|@Date_From  = '" + SQL_Format(Период.ДатаНачала) + "',
	|@Date_To    = '" + SQL_Format(Период.ДатаОкончания) + "'";
	НаборЗаписей = РаботаСВнешнимиСистемами.ADODBC_ВыполнитьЗапрос(Соединение, ТекстЗапроса);
	Если НаборЗаписей = Неопределено Тогда
		ЗарегистрироватьОшибку("Не удалось получить ID сессии!", ПараметрыСессии);
		Возврат;
	Иначе
		НаборЗаписей.MoveFirst();
		ИД_Сесии = НаборЗаписей.Fields.Item(0).Value;
	КонецЕсли;
#КонецОбласти
	
#Область ОЧИСТКА
	ТекстЗапроса = "DELETE FROM AM.Shares_Group_Ownership_Remains 
				   |WHERE [System_UID] = '" + КодКомпании + "' AND [Date] BETWEEN '" + SQL_Format(Период.ДатаНачала) + "' AND '" + SQL_Format(Период.ДатаОкончания) + "'";
	НаборЗаписей = РаботаСВнешнимиСистемами.ADODBC_ВыполнитьЗапрос(Соединение, ТекстЗапроса);
	Если НаборЗаписей = Неопределено Тогда
		ЗарегистрироватьОшибку("Перед выгрузкой данных не удалось очистить таблицу остатков!", ПараметрыСессии);
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = "DELETE FROM AM.Shares_Group_Ownership_Operations 
				   |WHERE [System_UID] = '" + КодКомпании + "' AND [Settlement_Date] BETWEEN '" + SQL_Format(Период.ДатаНачала) + "' AND '" + SQL_Format(Период.ДатаОкончания) + "'";
	НаборЗаписей = РаботаСВнешнимиСистемами.ADODBC_ВыполнитьЗапрос(Соединение, ТекстЗапроса);
	Если НаборЗаписей = Неопределено Тогда
		ЗарегистрироватьОшибку("Перед выгрузкой данных не удалось очистить таблицу операций!", ПараметрыСессии);
		Возврат;
	КонецЕсли;
#КонецОбласти
		
#Область ВЫГРУЗКА_ДАННЫХ	
	Данные = СформироватьДанныеДляВыгрузки();
	
	Для Каждого Элемент Из Данные Цикл
		Таблица = Элемент.Значение;
		Если Таблица.Количество() > 0 Тогда
			Для Каждого Строка Из Таблица Цикл
				ClientID = ?(КодыПифов.Получить(Строка.Client_ID) = Неопределено, Строка.Client_ID, КодыПифов.Получить(Строка.Client_ID));
				Если Элемент.Ключ = "Операции" Тогда
					ТекстЗапроса = "INSERT AM.Shares_Group_Ownership_Operations (
					|[System_UID],
					|[Settlement_Date],
					|[Settlement_Time],
					|[Company_ID],
					|[Client_ID],
					|[Client_Name],
					|[Invest_Code],
					|[Direction],
					|[Operation_Type_UID],
					|[Security_ID],
					|[Volume],
					|[Deal_Number],
					|[Deal_Date],
					|[Deal_Time])
					|
					|VALUES (  
					|'" + КодКомпании       				  + "',
					|'" + SQL_Format(Строка.Settlement_Date)  + "',
					|'" + SQL_Format(,Строка.Settlement_Date) + "',
					|'" + Строка.Company_ID					  + "',
					|'" + ClientID							  + "', 
					|'" + Строка.Client_Name				  + "',
					|'" + Строка.Invest_Code				  + "',
					|'" + Строка.Direction					  + "',
					|'" + Строка.Operation_Type_UID 		  + "',
					|'" + Строка.Security_ID				  + "',
					|'" + SQL_Format(,,Строка.Volume)		  + "',
					|'" + Строка.Deal_Number				  + "', 
					|'" + SQL_Format(Строка.Deal_Date)		  + "',
					|'" + SQL_Format(,Строка.Deal_Time)		  + "')";
					
				ИначеЕсли Элемент.Ключ = "Остатки" Тогда
					ТекстЗапроса = "INSERT AM.Shares_Group_Ownership_Remains (
					|[System_UID],
					|[Date],
					|[Company_ID],
					|[Client_ID],
					|[Invest_Code],
					|[Security_ID],
					|[Volume])
					|
					|VALUES (
					|'" + КодКомпании   			  + "',
					|'" + SQL_Format(Строка.Date)     + "',
					|'" + Строка.Company_ID		  	  + "',
					|'" + ClientID					  + "',
					|'" + Строка.Invest_Code		  + "',
					|'" + Строка.Security_ID		  + "',
					|'" + SQL_Format(,,Строка.Volume) + "')";
					
				КонецЕсли;
				
				НаборЗаписей = РаботаСВнешнимиСистемами.ADODBC_ВыполнитьЗапрос(Соединение, ТекстЗапроса);
				Если НаборЗаписей = Неопределено Тогда
					ЗарегистрироватьОшибку("Не удалось выпонить запрос! " + ТекстЗапроса, ПараметрыСессии);
					Возврат;
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
#КонецОбласти

	//Закрываем сессию
	НаборЗаписей = РаботаСВнешнимиСистемами.ADODBC_ВыполнитьЗапрос(Соединение, "EXEC AM.usp_Shares_Group_Ownership_Export_End @Session_ID = '" + SQL_Format(,,ИД_Сесии) + "'");
	Если НаборЗаписей = Неопределено Тогда
		ЗарегистрироватьОшибку("Не удалось выпонить запрос завершения сессии!", ПараметрыСессии);
		Возврат;
	КонецЕсли;
	//Если КодКомпании = "1С.UK.RPI" Тогда
	//	ВыполнитьПроверку(Соединение);
	//КонецЕсли;
	РаботаСВнешнимиСистемами.ADODBC_ЗакрытьСоединение(Соединение);
	
КонецПроцедуры

Процедура Выгрузить(ПараметрыСессии) Экспорт
		
	ВыгрузитьДанные(ПараметрыСессии);
	ОповеститьОбОшибках();
	
КонецПроцедуры

//В 1С8 нет Матрих кодов ПИФондов, есть коды ПАЕВ.
КодыПифов = Новый Соответствие;
КодыПифов.Вставить("586487" , "233198"); //ЗПИФ Ритм
КодыПифов.Вставить("66403"  , "229848"); //ИПИФ Дако
КодыПифов.Вставить("66405"  , "229849"); //ОПИФ РФА
КодыПифов.Вставить("588108" , "234050"); //ОПИФ Регион Еврооблигации
КодыПифов.Вставить("66407"  , "229850"); //ОПИФ РФО
КодыПифов.Вставить("585801" , "232955"); //ОПИФ Атлант
КодыПифов.Вставить("585799" , "232956"); //ОПИФ Глобус
КодыПифов.Вставить("585800" , "232957"); //ОПИФ Сфера
КодыПифов.Вставить("66408"  , "229851"); //ОПИФ РФС
КодыПифов.Вставить("588072" , "234049"); //ОПИФ Америка
КодыПифов.Вставить("588071" , "234051"); //ОПИФ ЗолотойЭталон
КодыПифов.Вставить("66537"  , "219159"); //ЗПИФ Коммерческие инвестиции
КодыПифов.Вставить("583122" , "232717"); //ЗПИФ комбинированный "Промышленные инвестиции"
КодыПифов.Вставить("579173" , "231382"); //ЗПИФ долгосрочных прямых инвестиций "Алгоритм"


ДополнительныеСвойства = Новый Структура;
